{
  "jobs": [
    {
      "data": {
        "slug": "4239",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4239",
        "title": "Solutions Engineer III, Corporate",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, India Overview GitHub is expanding its Corporate Solutions Engineering team and we're seeking experienced professionals to enhance our pre-sales support of our corporate customers. As a Solutions Engineer, you'll align technology solutions with customer needs and serve as a trusted advisor. The ideal candidate will be a key partner in driving technology adoption and integration, helping customers maximize GitHub’s value while gaining hands-on experience in solving complex technical challenges, deepening industry expertise, and influencing strategic decision-making. Responsibilities Develop and maintain technical relationships in the pre-sales stage with business customers and prospects, acting as a key technical point of contact to ensure customer satisfaction and product adoption. Collaborate with the Corporate Sales team to identify customer business requirements, match them to product features, and provide live demonstrations of the GitHub Enterprise platform. Serve as an intermediary between sales and technical teams, communicating customer feedback to influence product strategy and contributing to internal knowledge bases. Educate prospects on product implementation and usage, while advocating for customer interests by sharing feedback within GitHub. Assist customers in integrating GitHub with existing development tools and workflows, providing technical guidance on DevOps pipelines, code deployment options, and network infrastructure. Maintain awareness of trends in the Source Control Management industry and contribute to both internal and customer documentation to support product usage and adoption. Articulate the value of AI and DevSecOps to external stakeholders through pre-sales presentations, product demonstrations, and technical documentation. Showcase our products: Conduct (live) demos of GitHub’s products, integrating broader industry trends (e.g., AI, DevSecOps) and tools into tailored customer scenarios. Industry and Product Knowledge: Maintain an up-to-date understanding of GitHub’s product landscape, emerging trends in developer tools (e.g., Generative AI), and customer-specific challenges. Provide coaching and insights to internal teams based on industry expertise. Qualifications Required Qualifications: 4+ years’ experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR bachelor's degree in Computer Science, Information Technology, Engineering, or related field AND 2+ years’ experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR master's degree in Computer Science, Information Technology, Engineering, or related field, OR equivalent experience. Preferred Qualifications: 6+ years' experience in technical consulting, technical consultative selling, or related technical/sales/industry experience 1+ year(s) experience in digital transformation using software modernization to drive customer business outcomes 1+ year(s) experience in business consulting, consultative selling, or customer facing experience GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "India Remote",
        "country": "India",
        "country_code": "IN",
        "location_type": "ANY",
        "latitude": 20.593684,
        "longitude": 78.96288,
        "categories": [
          {
            "name": "Sales"
          }
        ],
        "tags2": [
          "IN-Remote"
        ],
        "tags3": [
          "Sales"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Individual Contributor"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "Global Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required Qualifications: 4+ years’ experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR bachelor's degree in Computer Science, Information Technology, Engineering, or related field AND 2+ years’ experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR master's degree in Computer Science, Information Technology, Engineering, or related field, OR equivalent experience. Preferred Qualifications: 6+ years' experience in technical consulting, technical consultative selling, or related technical/sales/industry experience 1+ year(s) experience in digital transformation using software modernization to drive customer business outcomes 1+ year(s) experience in business consulting, consultative selling, or customer facing experience",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "Develop and maintain technical relationships in the pre-sales stage with business customers and prospects, acting as a key technical point of contact to ensure customer satisfaction and product adoption. Collaborate with the Corporate Sales team to identify customer business requirements, match them to product features, and provide live demonstrations of the GitHub Enterprise platform. Serve as an intermediary between sales and technical teams, communicating customer feedback to influence product strategy and contributing to internal knowledge bases. Educate prospects on product implementation and usage, while advocating for customer interests by sharing feedback within GitHub. Assist customers in integrating GitHub with existing development tools and workflows, providing technical guidance on DevOps pipelines, code deployment options, and network infrastructure. Maintain awareness of trends in the Source Control Management industry and contribute to both internal and customer documentation to support product usage and adoption. Articulate the value of AI and DevSecOps to external stakeholders through pre-sales presentations, product demonstrations, and technical documentation. Showcase our products: Conduct (live) demos of GitHub’s products, integrating broader industry trends (e.g., AI, DevSecOps) and tools into tailored customer scenarios. Industry and Product Knowledge: Maintain an up-to-date understanding of GitHub’s product landscape, emerging trends in developer tools (e.g., Generative AI), and customer-specific challenges. Provide coaching and insights to internal teams based on industry expertise.",
        "posted_date": "2025-06-16T02:51:00+0000",
        "apply_url": "https://globalcareers-githubinc.icims.com/jobs/4239/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-01T03:54:59.422+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-06-27T14:18:30Z",
            "primary_posted_site_object": {
              "site": "globalcareers-githubinc",
              "siteId": "48855464-2bde-48e1-af86-f8c7872d8750",
              "datePosted": "2025-06-16T02:51:00+0000"
            },
            "config_keys": null,
            "revision_int": 7,
            "uuid": "2ac93ee6-da33-41aa-9cab-25c895f6b379"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/91428269219291846",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "SCIENCE_AND_ENGINEERING",
                "MANUFACTURING_AND_WAREHOUSE",
                "COMPUTER_AND_IT"
              ],
              "locations": [
                {
                  "radiusInMiles": 0.9480640893709554,
                  "postalAddress": {
                    "regionCode": "IN",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "India"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": 20.593684,
                    "longitude": 78.96288
                  }
                }
              ]
            },
            "jobHash": "d0cb9295fbbd5decc3d213a21bcd5efc",
            "jobSummary": "Develop and maintain technical relationships in the pre-sales stage with business customers and prospects, acting as a key technical point of contact to ensure customer satisfaction and product adoption. Collaborate with the Corporate Sales team to identify customer business requirements, match them to product features, and provide live demonstrations of the GitHub Enterprise platform. Serve as an intermediary between sales and technical teams, communicating customer feedback to influence product strategy and contributing to internal knowledge bases. Educate prospects on product implementation and usage, while advocating for customer interests by sharing feedback within GitHub. Assist customers in integrating GitHub with existing development tools and workflows, providing technical guidance on DevOps pipelines, code deployment options, and network infrastructure. Maintain awareness of trends in the Source Control Management industry and contribute to both internal and customer documentation to support product usage and adoption. Articulate the value of AI and DevSecOps to external stakeholders through pre-sales presentations, product demonstrations, and technical documentation. Showcase our products: Conduct (live) demos of GitHub’s products, integrating broader industry trends (e.g., AI, DevSecOps) and tools into tailored customer scenarios. Industry and Product Knowledge: Maintain an up-to-date understanding of GitHub’s product landscape, emerging trends in developer tools (e.g., Generative AI), and customer-specific challenges. Provide coaching and insights to internal teams based on industry expertise."
          },
          "import_id": "89806e58-8aa7-406c-976d-5cdc148ab4e6",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4239?lang=en-us",
          "client_code": "githubinc",
          "gdpr": false
        },
        "update_date": "2025-07-01T03:54:59+0000",
        "create_date": "2025-07-01T03:54:59+0000",
        "category": [
          " Sales"
        ],
        "full_location": "India",
        "short_location": "India",
        "multipleLocations": false
      }
    },
    {
      "data": {
        "slug": "4270",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4270",
        "title": "Senior Enterprise Account Executive III",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Netherlands Overview GitHub is expanding its Enterprise Sales team, and we’re seeking top-performing professionals to lead strategic and global account growth. As a Senior Enterprise Account Executive III, you will be responsible for managing a portfolio of significant, high-value enterprise accounts, driving large-scale digital transformation and influencing high level executive decision making. The ideal candidate will be a key driver of enterprise-wide adoption, developing long-term partnerships, negotiating complex enterprise agreements, and shaping GitHub’s presence in the global market while gaining unparalleled experience in strategic deal-making. Responsibilities Develop and execute complex account plans for an extensive portfolio of large and/or complex enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to maximize sales and partner impact. Manage the sales pipeline and forecasting process for a portfolio of global large and/or high complexity accounts, ensuring alignment with sales goals and risk mitigation. Engage with a large number of customers to understand their business and technology needs, advocating internally to prioritize their requests and enhance satisfaction. Provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts, positioning GitHub as a leader in the industry. Drive enterprise-wide solution selling initiatives, crafting comprehensive proposals that address the multifaceted needs of a complex portfolio of accounts. Qualifications Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in Business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level strategic sales or equivalent experience Knowledge of sales methodologies such as MEDDPICC or Challenger Sale, with the ability to apply these frameworks to drive sales success Demonstrated ability to understand customer needs and provide tailored solutions that drive business value Experience selling into technology accounts with an emphasis on the software development ecosystem is strongly preferred GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "Netherlands Remote",
        "country": "Netherlands",
        "country_code": "NL",
        "location_type": "ANY",
        "latitude": 52.132633,
        "longitude": 5.291265999999999,
        "categories": [
          {
            "name": "Sales"
          }
        ],
        "tags2": [
          "NL-Remote"
        ],
        "tags3": [
          "Sales"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Individual Contributor"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "Global Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in Business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level strategic sales or equivalent experience Knowledge of sales methodologies such as MEDDPICC or Challenger Sale, with the ability to apply these frameworks to drive sales success Demonstrated ability to understand customer needs and provide tailored solutions that drive business value Experience selling into technology accounts with an emphasis on the software development ecosystem is strongly preferred",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "Develop and execute complex account plans for an extensive portfolio of large and/or complex enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to maximize sales and partner impact. Manage the sales pipeline and forecasting process for a portfolio of global large and/or high complexity accounts, ensuring alignment with sales goals and risk mitigation. Engage with a large number of customers to understand their business and technology needs, advocating internally to prioritize their requests and enhance satisfaction. Provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts, positioning GitHub as a leader in the industry. Drive enterprise-wide solution selling initiatives, crafting comprehensive proposals that address the multifaceted needs of a complex portfolio of accounts.",
        "posted_date": "2025-06-17T15:04:00+0000",
        "apply_url": "https://globalcareers-githubinc.icims.com/jobs/4270/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-03T10:55:47.215+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-07-03T10:55:22Z",
            "primary_posted_site_object": {
              "site": "globalcareers-githubinc",
              "siteId": "48855464-2bde-48e1-af86-f8c7872d8750",
              "datePosted": "2025-06-17T15:04:00+0000"
            },
            "config_keys": null,
            "revision_int": 7,
            "uuid": "e9e2b029-4466-47b0-93b5-a8e7d5db5997"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/95509656381596358",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "SALES_AND_RETAIL"
              ],
              "locations": [
                {
                  "radiusInMiles": 0.08301454716055781,
                  "postalAddress": {
                    "regionCode": "NL",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "Netherlands"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": 52.132633,
                    "longitude": 5.291265999999999
                  }
                }
              ]
            },
            "jobHash": "d80a5f58b484c80d121a868057cc4b3a",
            "jobSummary": "Develop and execute complex account plans for an extensive portfolio of large and/or complex enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to maximize sales and partner impact. Manage the sales pipeline and forecasting process for a portfolio of global large and/or high complexity accounts, ensuring alignment with sales goals and risk mitigation. Engage with a large number of customers to understand their business and technology needs, advocating internally to prioritize their requests and enhance satisfaction. Provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts, positioning GitHub as a leader in the industry. Drive enterprise-wide solution selling initiatives, crafting comprehensive proposals that address the multifaceted needs of a complex portfolio of accounts."
          },
          "import_id": "7bc087c3-1e62-4754-916a-14c748452138",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4270?lang=en-us",
          "client_code": "githubinc",
          "gdpr": true
        },
        "update_date": "2025-07-03T10:55:47+0000",
        "create_date": "2025-07-01T03:55:02+0000",
        "category": [
          " Sales"
        ],
        "full_location": "Netherlands",
        "short_location": "Netherlands",
        "multipleLocations": false
      }
    },
    {
      "data": {
        "slug": "4250",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4250",
        "title": "Senior Enterprise Account Executive III",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Japan Overview GitHub is expanding its Enterprise Sales team, and we’re seeking top-performing professionals to lead strategic and global account growth. As a Senior Enterprise Account Executive III, you will be responsible for managing a portfolio of significant, high-value enterprise accounts, driving large-scale digital transformation and influencing high level executive decision making. The ideal candidate will be a key driver of enterprise-wide adoption, developing long-term partnerships, negotiating complex enterprise agreements, and shaping GitHub’s presence in the global market while gaining unparalleled experience in strategic deal-making. This candidate must also be skilled in new logo white space acquisition with the ability to compete and win based on value selling and strategic unsolicited proposals which are compelling. Responsibilities Build and discover new logo potential customers outside of a set account list. Develop and execute complex account plans for an extensive portfolio of large and/or complex enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level [C-suite] decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to maximize sales and partner impact. Have the ability to orchestrate partners as part of your deal lifecycle and align these tightly with your customers so that adoption motions can be quickly and easily actioned. Manage the sales pipeline and forecasting process for a portfolio of global large and/or high complexity accounts, ensuring alignment with sales goals and risk mitigation. Engage with a large number of customers to understand their business and technology needs, advocating internally to prioritize their requests and enhance satisfaction. Provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts, positioning GitHub as a leader in the industry. Drive enterprise-wide solution selling initiatives, crafting comprehensive proposals that address the multifaceted needs of a complex portfolio of accounts. Qualifications Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in Business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Native-level Japanese and proficient English language skills. Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level strategic sales or equivalent experience Knowledge of sales methodologies such as MEDDPICC or Challenger Sale, with the ability to apply these frameworks to drive sales success Demonstrated ability to understand customer needs and provide tailored solutions that drive business value Experience selling into technology area within large accounts with an emphasis on the software development ecosystem is strongly preferred Expertise in crafting comprehensive proposals that address the multifaceted needs of a diverse set of accounts Experience in aligning cross-functional strategies across the organization to deliver a seamless customer experience and achieve common goals Ability to provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "Japan Remote",
        "country": "Japan",
        "country_code": "JP",
        "location_type": "ANY",
        "latitude": 36.204824,
        "longitude": 138.252924,
        "categories": [
          {
            "name": "Sales"
          }
        ],
        "tags2": [
          "JP-Remote"
        ],
        "tags3": [
          "Sales"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Individual Contributor"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "Global Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in Business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Native-level Japanese and proficient English language skills. Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level strategic sales or equivalent experience Knowledge of sales methodologies such as MEDDPICC or Challenger Sale, with the ability to apply these frameworks to drive sales success Demonstrated ability to understand customer needs and provide tailored solutions that drive business value Experience selling into technology area within large accounts with an emphasis on the software development ecosystem is strongly preferred Expertise in crafting comprehensive proposals that address the multifaceted needs of a diverse set of accounts Experience in aligning cross-functional strategies across the organization to deliver a seamless customer experience and achieve common goals Ability to provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "Build and discover new logo potential customers outside of a set account list. Develop and execute complex account plans for an extensive portfolio of large and/or complex enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level [C-suite] decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to maximize sales and partner impact. Have the ability to orchestrate partners as part of your deal lifecycle and align these tightly with your customers so that adoption motions can be quickly and easily actioned. Manage the sales pipeline and forecasting process for a portfolio of global large and/or high complexity accounts, ensuring alignment with sales goals and risk mitigation. Engage with a large number of customers to understand their business and technology needs, advocating internally to prioritize their requests and enhance satisfaction. Provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts, positioning GitHub as a leader in the industry. Drive enterprise-wide solution selling initiatives, crafting comprehensive proposals that address the multifaceted needs of a complex portfolio of accounts.",
        "posted_date": "2025-06-26T01:54:00+0000",
        "apply_url": "https://globalcareers-githubinc.icims.com/jobs/4250/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-01T03:55:02.160+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-06-27T14:15:55Z",
            "primary_posted_site_object": {
              "site": "globalcareers-githubinc",
              "siteId": "48855464-2bde-48e1-af86-f8c7872d8750",
              "datePosted": "2025-06-26T01:54:00+0000"
            },
            "config_keys": null,
            "revision_int": 6,
            "uuid": "1f51a245-3de6-4d3c-8065-2d71d8b88780"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/86502457126855366",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "SALES_AND_RETAIL"
              ],
              "locations": [
                {
                  "radiusInMiles": 1.0049957522927677,
                  "postalAddress": {
                    "regionCode": "JP",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "Japan"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": 36.204824,
                    "longitude": 138.252924
                  }
                }
              ]
            },
            "jobHash": "ccccffd2e91e8e45e298efd9727d3f81",
            "jobSummary": "Build and discover new logo potential customers outside of a set account list. Develop and execute complex account plans for an extensive portfolio of large and/or complex enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level [C-suite] decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to maximize sales and partner impact. Have the ability to orchestrate partners as part of your deal lifecycle and align these tightly with your customers so that adoption motions can be quickly and easily actioned. Manage the sales pipeline and forecasting process for a portfolio of global large and/or high complexity accounts, ensuring alignment with sales goals and risk mitigation. Engage with a large number of customers to understand their business and technology needs, advocating internally to prioritize their requests and enhance satisfaction. Provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts, positioning GitHub as a leader in the industry. Drive enterprise-wide solution selling initiatives, crafting comprehensive proposals that address the multifaceted needs of a complex portfolio of accounts."
          },
          "import_id": "7162f6f7-1226-4f24-b09b-d57573c164b6",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4250?lang=en-us",
          "client_code": "githubinc",
          "gdpr": false
        },
        "update_date": "2025-07-01T03:55:02+0000",
        "create_date": "2025-07-01T03:55:02+0000",
        "category": [
          " Sales"
        ],
        "full_location": "Japan",
        "short_location": "Japan",
        "multipleLocations": false
      }
    },
    {
      "data": {
        "slug": "4226",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4226",
        "title": "Senior Mid Market Account Executive I",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, India Overview GitHub is expanding its Mid-Market Account team and seeks experienced professionals to enhance our sales efforts. As a Senior Mid-Market Account Executive I, you will forge strong relationships with executive decision-makers, develop and execute account plans, and align GitHub's sales strategies with customer needs. The ideal candidate will be a key partner in driving business transformation for mid-market customers, influencing strategic technology adoption while gaining deep industry insights and contributing to long-term customer success and growth. Responsibilities Manage a medium to large number of named accounts, focusing on scaling business growth and expanding reach within the Mid-Market segment. Engage with a broader network of decision makers and stakeholders, leveraging industry expertise to build stronger relationships and influence decision-making. Develop comprehensive strategies for a portfolio of large accounts, ensuring alignment with business priorities and leveraging data-driven insights for market analysis. Utilize extensive industry knowledge to drive innovation and business transformation for customers. Identify and pursue new market opportunities, leveraging industry knowledge and strategic partnerships to expand GitHub's presence within the Mid-Market segment. Drive revenue growth through the team by helping them build a strong pipeline, accurately forecast, and drive new and existing business opportunities. Qualifications Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Ability to travel up to 25% to serve business or client needs Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level DevOps, DevSecOps, and/or AI products strategic sales or equivalent experience Deep knowledge of the mid-market segment, including key trends, challenges, and opportunities, to inform strategic account planning and execution Experience working with international clients or in a global sales environment, providing insights into diverse market dynamics and customer needs Ability to create accurate sales forecasting and pipeline management, ensuring a clear view of future revenue and enabling proactive decision making GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "India Remote",
        "country": "India",
        "country_code": "IN",
        "location_type": "ANY",
        "latitude": 20.593684,
        "longitude": 78.96288,
        "categories": [
          {
            "name": "Sales"
          }
        ],
        "tags2": [
          "IN-Remote"
        ],
        "tags3": [
          "Sales"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Individual Contributor"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "Global Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Ability to travel up to 25% to serve business or client needs Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level DevOps, DevSecOps, and/or AI products strategic sales or equivalent experience Deep knowledge of the mid-market segment, including key trends, challenges, and opportunities, to inform strategic account planning and execution Experience working with international clients or in a global sales environment, providing insights into diverse market dynamics and customer needs Ability to create accurate sales forecasting and pipeline management, ensuring a clear view of future revenue and enabling proactive decision making",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "Manage a medium to large number of named accounts, focusing on scaling business growth and expanding reach within the Mid-Market segment. Engage with a broader network of decision makers and stakeholders, leveraging industry expertise to build stronger relationships and influence decision-making. Develop comprehensive strategies for a portfolio of large accounts, ensuring alignment with business priorities and leveraging data-driven insights for market analysis. Utilize extensive industry knowledge to drive innovation and business transformation for customers. Identify and pursue new market opportunities, leveraging industry knowledge and strategic partnerships to expand GitHub's presence within the Mid-Market segment. Drive revenue growth through the team by helping them build a strong pipeline, accurately forecast, and drive new and existing business opportunities.",
        "posted_date": "2025-06-17T16:21:00+0000",
        "apply_url": "https://globalcareers-githubinc.icims.com/jobs/4226/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-01T03:54:59.422+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-06-30T13:30:13Z",
            "primary_posted_site_object": {
              "site": "globalcareers-githubinc",
              "siteId": "48855464-2bde-48e1-af86-f8c7872d8750",
              "datePosted": "2025-06-17T16:21:00+0000"
            },
            "config_keys": null,
            "revision_int": 8,
            "uuid": "1cc6969d-cb5d-47cb-9817-3d2bda7081d3"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/121915527634264774",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "SALES_AND_RETAIL"
              ],
              "locations": [
                {
                  "radiusInMiles": 0.9480640893709554,
                  "postalAddress": {
                    "regionCode": "IN",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "India"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": 20.593684,
                    "longitude": 78.96288
                  }
                }
              ]
            },
            "jobHash": "4c263717ac3ee42c7e0122b8e3fa421e",
            "jobSummary": "Manage a medium to large number of named accounts, focusing on scaling business growth and expanding reach within the Mid-Market segment. Engage with a broader network of decision makers and stakeholders, leveraging industry expertise to build stronger relationships and influence decision-making. Develop comprehensive strategies for a portfolio of large accounts, ensuring alignment with business priorities and leveraging data-driven insights for market analysis. Utilize extensive industry knowledge to drive innovation and business transformation for customers. Identify and pursue new market opportunities, leveraging industry knowledge and strategic partnerships to expand GitHub's presence within the Mid-Market segment. Drive revenue growth through the team by helping them build a strong pipeline, accurately forecast, and drive new and existing business opportunities."
          },
          "import_id": "89806e58-8aa7-406c-976d-5cdc148ab4e6",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4226?lang=en-us",
          "client_code": "githubinc",
          "gdpr": false
        },
        "update_date": "2025-07-01T03:54:59+0000",
        "create_date": "2025-07-01T03:54:59+0000",
        "category": [
          " Sales"
        ],
        "full_location": "India",
        "short_location": "India",
        "multipleLocations": false
      }
    },
    {
      "data": {
        "slug": "4145",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4145",
        "title": "Sr. Mgr, Software Engineering",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview We’re looking for a Senior Software Engineering Manager to help build foundational components of the Copilot Platform. This is an exciting role in a fast paced environment with high impact. A manager working on this team needs to have a strong balance of people, technical, and project management skills - flexing their skill sets to empower the team to create innovative solutions in the AI space. Responsibilities A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with internal and external engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom, and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects to efficiently collaborate with teams in disparate timezones Communicating effectively to support internal users, and inform stakeholders of progress as well as system status and team health Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression, coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, resilient systems, and high quality code Ensuring the team iteratively ships features and bug fixes; balancing speed to market with future velocity Leveraging state of the art AI tooling to maximize productivity for yourself and your direct reports Qualifications Required qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. 1+ year(s) experience developing a strategy and roadmap in partnership with your team and stakeholders. 1+ year)s) experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion Preferred qualifications Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience managing platform teams Experience with delivering products in the artificial intelligence space Experience working with research or applied scientists GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "United Kingdom Remote",
        "country": "United Kingdom",
        "country_code": "GB",
        "location_type": "ANY",
        "latitude": 55.378051,
        "longitude": -3.435973,
        "categories": [
          {
            "name": "Engineering"
          }
        ],
        "tags2": [
          "UK-Remote"
        ],
        "tags3": [
          "Engineering"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Senior Manager"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "Global Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. 1+ year(s) experience developing a strategy and roadmap in partnership with your team and stakeholders. 1+ year)s) experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion Preferred qualifications Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience managing platform teams Experience with delivering products in the artificial intelligence space Experience working with research or applied scientists",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with internal and external engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom, and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects to efficiently collaborate with teams in disparate timezones Communicating effectively to support internal users, and inform stakeholders of progress as well as system status and team health Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression, coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, resilient systems, and high quality code Ensuring the team iteratively ships features and bug fixes; balancing speed to market with future velocity Leveraging state of the art AI tooling to maximize productivity for yourself and your direct reports",
        "posted_date": "2025-07-08T22:31:00+0000",
        "posting_expiry_date": "2025-07-14T23:00:00+0000",
        "apply_url": "https://globalcareers-githubinc.icims.com/jobs/4145/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-08T22:32:11.655+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-07-08T22:31:22Z",
            "primary_posted_site_object": {
              "site": "globalcareers-githubinc",
              "validThrough": "2025-07-14T23:00:00+0000",
              "siteId": "48855464-2bde-48e1-af86-f8c7872d8750",
              "datePosted": "2025-07-08T22:31:00+0000"
            },
            "config_keys": null,
            "revision_int": 8,
            "uuid": "2c7c9a01-9b49-49a3-acc7-ec365df600d2"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/89006015038530246",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "COMPUTER_AND_IT",
                "MANAGEMENT"
              ],
              "locations": [
                {
                  "radiusInMiles": 0.5229118491937161,
                  "postalAddress": {
                    "regionCode": "GB",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "United Kingdom"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": 55.378051,
                    "longitude": -3.435973
                  }
                }
              ]
            },
            "jobHash": "a5a50de1e82f2cd05825bc3b40395c92",
            "jobSummary": "A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with internal and external engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom, and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects to efficiently collaborate with teams in disparate timezones Communicating effectively to support internal users, and inform stakeholders of progress as well as system status and team health Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression, coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, resilient systems, and high quality code Ensuring the team iteratively ships features and bug fixes; balancing speed to market with future velocity Leveraging state of the art AI tooling to maximize productivity for yourself and your direct reports"
          },
          "import_id": "541ccbae-d813-4e73-b07a-0da60f85e700",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4145?lang=en-us",
          "client_code": "githubinc",
          "gdpr": true
        },
        "update_date": "2025-07-08T22:32:11+0000",
        "create_date": "2025-07-08T22:32:11+0000",
        "category": [
          " Engineering"
        ],
        "full_location": "United Kingdom",
        "short_location": "United Kingdom",
        "multipleLocations": false
      }
    },
    {
      "data": {
        "slug": "4262",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4262",
        "title": "Senior Solutions Engineer",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is growing its Customer Engineering team and we're seeking experienced professionals to elevate our technical customer engagement efforts. As a Senior Solutions Engineer, you will synthesize and integrate diverse business and industry insights to support customer digital transformation initiatives and align customer business requirements with GitHub's product features. The ideal candidate will be a strategic partner in driving customer success, leveraging deep industry insights to influence digital transformation while gaining hands-on experience in solving complex business challenges, fostering strong relationships, and shaping the future of GitHub’s customer engagement strategies. Responsibilities Engage in pre-sales activities with large customers to align and influence business partners and customer stakeholders, aiming for a technical win and driving solution selection. Develop and maintain external relationships within the customer organization to support strategic alignment and solution adoption. Identify customer issues and collaborate with technical teams to present solutions, conducting proofs of concept and product demos to address technical challenges. Analyze customer situations to advise on gaps that GitHub solutions can fill, contributing to strategic frameworks and roadmaps that address customer pain points. Assist in building and delivering content for marketing events, acting as a liaison to enhance customer engagement and showcase GitHub's value proposition. Develop expertise in GitHub Advanced Security, understanding its capabilities and articulating GitHub's approach to application security to customers, acting as a trusted advisor in security program development. Synthesize and communicate business and industry insights to identify growth opportunities and align product features with customer digital transformation initiatives. Design and develop innovative solutions that leverage GitHub's platform capabilities to address complex customer challenges, ensuring alignment with their strategic goals. Collaborate with sales and account management teams and partners to develop strategic account plans that drive long-term customer success and growth. Qualifications Required Qualifications: 8+ years experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR bachelor's degree in Computer Science, Information Technology, Engineering, or related field AND 4+ years’ experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR master's degree in Computer Science, Information Technology, Engineering, or related field AND 2+ years’ experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR doctorate in Computer Science, Information Technology, Engineering, or related field, OR equivalent experience. Experience owning all technical aspects of the sales cycle from discovery to qualification to proof-of-concept design/execution to post-sales transition. Ability to travel up to 25% when needed. Preferred Qualifications: 10+ years' experience in technical consulting, technical consultative selling, or related technical/sales/industry experience . 3+ years’ experience in digital transformation using software modernization to drive customer business outcomes 3+ years’ experience in business consulting, consultative selling, or customer-facing experience. 5+ years’ experience orchestrating technical, support, and/or partner teams. Extensive experience in the software development industry, with a focus on digital transformation and the ability to translate complex technical concepts into clear, actionable strategies for customers. Compensation Range The base salary range for this job is USD $88,900.00 - USD $235,900.00 /Yr. In addition, this role also has the opportunity to earn sales incentives. On target earnings (OTE) is based on a 70/30 base salary/sales incentive. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "US Remote",
        "country": "United States",
        "country_code": "US",
        "location_type": "ANY",
        "latitude": 38.7945952,
        "longitude": -106.5348379,
        "categories": [
          {
            "name": "Revenue"
          }
        ],
        "tags2": [
          "US-Remote"
        ],
        "tags3": [
          "Revenue"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Individual Contributor"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "US Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required Qualifications: 8+ years experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR bachelor's degree in Computer Science, Information Technology, Engineering, or related field AND 4+ years’ experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR master's degree in Computer Science, Information Technology, Engineering, or related field AND 2+ years’ experience in technical consulting, technical consultative selling, or related technical/sales/industry experience, OR doctorate in Computer Science, Information Technology, Engineering, or related field, OR equivalent experience. Experience owning all technical aspects of the sales cycle from discovery to qualification to proof-of-concept design/execution to post-sales transition. Ability to travel up to 25% when needed. Preferred Qualifications: 10+ years' experience in technical consulting, technical consultative selling, or related technical/sales/industry experience . 3+ years’ experience in digital transformation using software modernization to drive customer business outcomes 3+ years’ experience in business consulting, consultative selling, or customer-facing experience. 5+ years’ experience orchestrating technical, support, and/or partner teams. Extensive experience in the software development industry, with a focus on digital transformation and the ability to translate complex technical concepts into clear, actionable strategies for customers.",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "Engage in pre-sales activities with large customers to align and influence business partners and customer stakeholders, aiming for a technical win and driving solution selection. Develop and maintain external relationships within the customer organization to support strategic alignment and solution adoption. Identify customer issues and collaborate with technical teams to present solutions, conducting proofs of concept and product demos to address technical challenges. Analyze customer situations to advise on gaps that GitHub solutions can fill, contributing to strategic frameworks and roadmaps that address customer pain points. Assist in building and delivering content for marketing events, acting as a liaison to enhance customer engagement and showcase GitHub's value proposition. Develop expertise in GitHub Advanced Security, understanding its capabilities and articulating GitHub's approach to application security to customers, acting as a trusted advisor in security program development. Synthesize and communicate business and industry insights to identify growth opportunities and align product features with customer digital transformation initiatives. Design and develop innovative solutions that leverage GitHub's platform capabilities to address complex customer challenges, ensuring alignment with their strategic goals. Collaborate with sales and account management teams and partners to develop strategic account plans that drive long-term customer success and growth.",
        "posted_date": "2025-06-13T14:42:00+0000",
        "apply_url": "https://careers-githubinc.icims.com/jobs/4262/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-10T21:04:12.486+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-07-10T21:03:20Z",
            "primary_posted_site_object": {
              "site": "careers-githubinc",
              "siteId": "7b8b35d9-a49c-4724-a527-04dfa39eb3c9",
              "datePosted": "2025-06-13T14:42:00+0000"
            },
            "config_keys": null,
            "revision_int": 10,
            "uuid": "3b201ce1-be43-4bf9-a179-e2ecbd2f1ce6"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/78612361685934790",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "COMPUTER_AND_IT"
              ],
              "locations": [
                {
                  "radiusInMiles": 2.6691467883166546,
                  "postalAddress": {
                    "regionCode": "US",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "United States"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": 38.7945952,
                    "longitude": -106.5348379
                  }
                }
              ]
            },
            "jobHash": "6551e06e48a8af8e64f6390b2faa6b8b",
            "jobSummary": "Engage in pre-sales activities with large customers to align and influence business partners and customer stakeholders, aiming for a technical win and driving solution selection. Develop and maintain external relationships within the customer organization to support strategic alignment and solution adoption. Identify customer issues and collaborate with technical teams to present solutions, conducting proofs of concept and product demos to address technical challenges. Analyze customer situations to advise on gaps that GitHub solutions can fill, contributing to strategic frameworks and roadmaps that address customer pain points. Assist in building and delivering content for marketing events, acting as a liaison to enhance customer engagement and showcase GitHub's value proposition. Develop expertise in GitHub Advanced Security, understanding its capabilities and articulating GitHub's approach to application security to customers, acting as a trusted advisor in security program development. Synthesize and communicate business and industry insights to identify growth opportunities and align product features with customer digital transformation initiatives. Design and develop innovative solutions that leverage GitHub's platform capabilities to address complex customer challenges, ensuring alignment with their strategic goals. Collaborate with sales and account management teams and partners to develop strategic account plans that drive long-term customer success and growth."
          },
          "import_id": "0ed29cf4-3a95-4a8d-8ddf-4df3a2651016",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4262?lang=en-us",
          "client_code": "githubinc",
          "gdpr": false
        },
        "update_date": "2025-07-10T21:04:12+0000",
        "create_date": "2025-07-01T03:54:54+0000",
        "category": [
          " Revenue"
        ],
        "full_location": "United States",
        "short_location": "United States",
        "multipleLocations": false
      }
    },
    {
      "data": {
        "slug": "4246",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4246",
        "title": "Strategic Account Manager",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Japan Overview GitHub helps companies and organizations succeed by allowing them to build better software together. We're looking for a tenured and highly experienced Strategic Account Manager to work with our largest customers and new prospects in Japan and to build strong relationships, help them learn the value of GitHub’s platform to impact their business, and drive the buying process for the financial services industry. We care about our customer’s long-term success, and we’re extremely passionate about the quality of our work and the caliber of our people. The ideal candidate will have the aptitude and passion to become a master of GitHub’s product capabilities, underlying technology, and competitive advantages to build valuable solutions for our customers. If you are technically curious, love leading teams toward common goals, and moving fast, we want you. The role will report to the Country Leader in Japan. Responsibilities Strategic territory and account planning. Develop account plans, business plans, opportunity plans and resource requirements to drive our installed and new customers to land the GitHub platform and upsell new products for the Japan FSI market. Analyze and measure account plans for customer and company success. Collaborate partners and Microsoft to penetrate strategic accounts through their global entities. Provide accurate forecasting for in and out quarter opportunities and quarterly revenue commitments. Be the primary owner of the customer and the enterprise business being the liaison to GitHub and work with the V-team across multiple regions of GitHub and Microsoft. Risk Management. Manage, report, update pipeline status on Salesforce CRM, forecast commitment and update next actions weekly to transparent activities and to get management support to mitigate any sales risks. Well experienced pipeline generation, forecasting, reporting and risk management. Network building. Be able to build executive relationships inside customers and partners. To escalate and control their decision making process, relationships from engineers, procurement to director level are also required. Be able to build a solid network at GitHub and Microsoft to ensure success and work with technical product management, engineering, support, technical sales and professional services to bring the full weight of GitHub to help customers. Manage by influence. Focus on closing one big deal rather than transacting a series of small orders through the year. Sell business value rather than product functionalities. Become the best buddy of Economic Buyer and eager to build Champion and CoE. Establish strong understanding of GitHub products and solutions and how to position GitHub as a ‘platform’ capturing the business value proposition for each customer opportunity. Understand how to counsel customers on best practices for leveraging GitHub products and services to become innovation leaders. Inform customers about their industries in the context of Software Development and offer unique insights to encourage customers to think differently about their business and discover the true value of working with GitHub. Sell value and provide real ROI analysis with our products and services for prospects and new customers. Be able to work programmatically with prospects and new customers on a set of metrics to show them how to improve their business by properly using GitHub products and services, understanding the value and use of Business Value Engineering and its best application to closing large enterprise deals. Deal process, objection handling and driving momentum. Understand how to map prospect and buying processes, help new buyers navigate deals to close, identify deal stakeholders, mobilizers and blockers in order to drive deal momentum to close. Independently and collaboratively strategize for solving deal-level challenges. Qualifications Required Qualifications: 9+ years experience in technology-related sales or a related field OR Bachelor's Degree in Business, Technology, Liberal Arts, or related field AND 7+ years experience in technology-related sales, technical selling, or a related field OR Master's Degree in Business Administration AND 5+ years experience in technology-related sales, technical selling, or a related field OR equivalent experience. Native-level Japanese and proficient English language skills. Experienced top down and bottom up sales approach over CxO, Directors, Managers, Project Managers, Engineers, Procurement, SIers, partners, etc Experienced using sales methodologies (ie.MEDDPICC, Challenger) Preferred Qualifications: 5+ years enterprise-level strategic sales or equivalent experience Experienced selling into FSI industry Consistent track record of exceeding quota and effectively leveraging resources Collaborative and team oriented seller, organized and detail oriented Strong technical aptitude and interest in GitHub, DevOps, Application Security and/or AI Experience in selling subscription and consumption based licenses Willingness to meet customers in person in post pandemic world Ability to work across different time zones based on customer needs eg.AMER & EMEA GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "Japan Remote",
        "country": "Japan",
        "country_code": "JP",
        "location_type": "ANY",
        "latitude": 36.204824,
        "longitude": 138.252924,
        "categories": [
          {
            "name": "Sales"
          }
        ],
        "tags2": [
          "JP-Remote"
        ],
        "tags3": [
          "Sales"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Individual Contributor"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "Global Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required Qualifications: 9+ years experience in technology-related sales or a related field OR Bachelor's Degree in Business, Technology, Liberal Arts, or related field AND 7+ years experience in technology-related sales, technical selling, or a related field OR Master's Degree in Business Administration AND 5+ years experience in technology-related sales, technical selling, or a related field OR equivalent experience. Native-level Japanese and proficient English language skills. Experienced top down and bottom up sales approach over CxO, Directors, Managers, Project Managers, Engineers, Procurement, SIers, partners, etc Experienced using sales methodologies (ie.MEDDPICC, Challenger) Preferred Qualifications: 5+ years enterprise-level strategic sales or equivalent experience Experienced selling into FSI industry Consistent track record of exceeding quota and effectively leveraging resources Collaborative and team oriented seller, organized and detail oriented Strong technical aptitude and interest in GitHub, DevOps, Application Security and/or AI Experience in selling subscription and consumption based licenses Willingness to meet customers in person in post pandemic world Ability to work across different time zones based on customer needs eg.AMER & EMEA",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "Strategic territory and account planning. Develop account plans, business plans, opportunity plans and resource requirements to drive our installed and new customers to land the GitHub platform and upsell new products for the Japan FSI market. Analyze and measure account plans for customer and company success. Collaborate partners and Microsoft to penetrate strategic accounts through their global entities. Provide accurate forecasting for in and out quarter opportunities and quarterly revenue commitments. Be the primary owner of the customer and the enterprise business being the liaison to GitHub and work with the V-team across multiple regions of GitHub and Microsoft. Risk Management. Manage, report, update pipeline status on Salesforce CRM, forecast commitment and update next actions weekly to transparent activities and to get management support to mitigate any sales risks. Well experienced pipeline generation, forecasting, reporting and risk management. Network building. Be able to build executive relationships inside customers and partners. To escalate and control their decision making process, relationships from engineers, procurement to director level are also required. Be able to build a solid network at GitHub and Microsoft to ensure success and work with technical product management, engineering, support, technical sales and professional services to bring the full weight of GitHub to help customers. Manage by influence. Focus on closing one big deal rather than transacting a series of small orders through the year. Sell business value rather than product functionalities. Become the best buddy of Economic Buyer and eager to build Champion and CoE. Establish strong understanding of GitHub products and solutions and how to position GitHub as a ‘platform’ capturing the business value proposition for each customer opportunity. Understand how to counsel customers on best practices for leveraging GitHub products and services to become innovation leaders. Inform customers about their industries in the context of Software Development and offer unique insights to encourage customers to think differently about their business and discover the true value of working with GitHub. Sell value and provide real ROI analysis with our products and services for prospects and new customers. Be able to work programmatically with prospects and new customers on a set of metrics to show them how to improve their business by properly using GitHub products and services, understanding the value and use of Business Value Engineering and its best application to closing large enterprise deals. Deal process, objection handling and driving momentum. Understand how to map prospect and buying processes, help new buyers navigate deals to close, identify deal stakeholders, mobilizers and blockers in order to drive deal momentum to close. Independently and collaboratively strategize for solving deal-level challenges.",
        "posted_date": "2025-06-25T01:17:00+0000",
        "apply_url": "https://globalcareers-githubinc.icims.com/jobs/4246/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-01T03:54:59.422+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-06-27T14:15:36Z",
            "primary_posted_site_object": {
              "site": "globalcareers-githubinc",
              "siteId": "48855464-2bde-48e1-af86-f8c7872d8750",
              "datePosted": "2025-06-25T01:17:00+0000"
            },
            "config_keys": null,
            "revision_int": 6,
            "uuid": "eaa22f00-d00a-4be7-b859-421667a7cb37"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/110216723914728134",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "SALES_AND_RETAIL",
                "MANAGEMENT"
              ],
              "locations": [
                {
                  "radiusInMiles": 1.0049957522927677,
                  "postalAddress": {
                    "regionCode": "JP",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "Japan"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": 36.204824,
                    "longitude": 138.252924
                  }
                }
              ]
            },
            "jobHash": "ec7790bce617712ff12863db43e77592",
            "jobSummary": "Strategic territory and account planning. Develop account plans, business plans, opportunity plans and resource requirements to drive our installed and new customers to land the GitHub platform and upsell new products for the Japan FSI market. Analyze and measure account plans for customer and company success. Collaborate partners and Microsoft to penetrate strategic accounts through their global entities. Provide accurate forecasting for in and out quarter opportunities and quarterly revenue commitments. Be the primary owner of the customer and the enterprise business being the liaison to GitHub and work with the V-team across multiple regions of GitHub and Microsoft. Risk Management. Manage, report, update pipeline status on Salesforce CRM, forecast commitment and update next actions weekly to transparent activities and to get management support to mitigate any sales risks. Well experienced pipeline generation, forecasting, reporting and risk management. Network building. Be able to build executive relationships inside customers and partners. To escalate and control their decision making process, relationships from engineers, procurement to director level are also required. Be able to build a solid network at GitHub and Microsoft to ensure success and work with technical product management, engineering, support, technical sales and professional services to bring the full weight of GitHub to help customers. Manage by influence. Focus on closing one big deal rather than transacting a series of small orders through the year. Sell business value rather than product functionalities. Become the best buddy of Economic Buyer and eager to build Champion and CoE. Establish strong understanding of GitHub products and solutions and how to position GitHub as a ‘platform’ capturing the business value proposition for each customer opportunity. Understand how to counsel customers on best practices for leveraging GitHub products and services to become innovation leaders. Inform customers about their industries in the context of Software Development and offer unique insights to encourage customers to think differently about their business and discover the true value of working with GitHub. Sell value and provide real ROI analysis with our products and services for prospects and new customers. Be able to work programmatically with prospects and new customers on a set of metrics to show them how to improve their business by properly using GitHub products and services, understanding the value and use of Business Value Engineering and its best application to closing large enterprise deals. Deal process, objection handling and driving momentum. Understand how to map prospect and buying processes, help new buyers navigate deals to close, identify deal stakeholders, mobilizers and blockers in order to drive deal momentum to close. Independently and collaboratively strategize for solving deal-level challenges."
          },
          "import_id": "89806e58-8aa7-406c-976d-5cdc148ab4e6",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4246?lang=en-us",
          "client_code": "githubinc",
          "gdpr": false
        },
        "update_date": "2025-07-01T03:54:59+0000",
        "create_date": "2025-07-01T03:54:59+0000",
        "category": [
          " Sales"
        ],
        "full_location": "Japan",
        "short_location": "Japan",
        "multipleLocations": false
      }
    },
    {
      "data": {
        "slug": "4269",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4269",
        "title": "Senior Enterprise Account Executive III",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is expanding its Enterprise Sales team, and we’re seeking top-performing professionals to lead strategic and global account growth. As a Senior Enterprise Account Executive III, you will be responsible for managing a portfolio of significant, high-value enterprise accounts, driving large-scale digital transformation and influencing high level executive decision making. The ideal candidate will be a key driver of enterprise-wide adoption, developing long-term partnerships, negotiating complex enterprise agreements, and shaping GitHub’s presence in the global market while gaining unparalleled experience in strategic deal-making. Responsibilities Develop and execute complex account plans for an extensive portfolio of large and/or complex enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to maximize sales and partner impact. Manage the sales pipeline and forecasting process for a portfolio of global large and/or high complexity accounts, ensuring alignment with sales goals and risk mitigation. Engage with a large number of customers to understand their business and technology needs, advocating internally to prioritize their requests and enhance satisfaction. Provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts, positioning GitHub as a leader in the industry. Drive enterprise-wide solution selling initiatives, crafting comprehensive proposals that address the multifaceted needs of a complex portfolio of accounts. Qualifications Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in Business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level strategic sales or equivalent experience Knowledge of sales methodologies such as MEDDPICC or Challenger Sale, with the ability to apply these frameworks to drive sales success Demonstrated ability to understand customer needs and provide tailored solutions that drive business value Experience selling into technology accounts with an emphasis on the software development ecosystem is strongly preferred GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "United Kingdom Remote",
        "country": "United Kingdom",
        "country_code": "GB",
        "location_type": "ANY",
        "latitude": 55.378051,
        "longitude": -3.435973,
        "categories": [
          {
            "name": "Sales"
          }
        ],
        "tags2": [
          "UK-Remote"
        ],
        "tags3": [
          "Sales"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Individual Contributor"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "Global Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in Business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level strategic sales or equivalent experience Knowledge of sales methodologies such as MEDDPICC or Challenger Sale, with the ability to apply these frameworks to drive sales success Demonstrated ability to understand customer needs and provide tailored solutions that drive business value Experience selling into technology accounts with an emphasis on the software development ecosystem is strongly preferred",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "Develop and execute complex account plans for an extensive portfolio of large and/or complex enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to maximize sales and partner impact. Manage the sales pipeline and forecasting process for a portfolio of global large and/or high complexity accounts, ensuring alignment with sales goals and risk mitigation. Engage with a large number of customers to understand their business and technology needs, advocating internally to prioritize their requests and enhance satisfaction. Provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts, positioning GitHub as a leader in the industry. Drive enterprise-wide solution selling initiatives, crafting comprehensive proposals that address the multifaceted needs of a complex portfolio of accounts.",
        "posted_date": "2025-06-17T15:03:00+0000",
        "apply_url": "https://globalcareers-githubinc.icims.com/jobs/4269/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-03T10:56:47.211+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-07-03T10:55:50Z",
            "primary_posted_site_object": {
              "site": "globalcareers-githubinc",
              "siteId": "48855464-2bde-48e1-af86-f8c7872d8750",
              "datePosted": "2025-06-17T15:03:00+0000"
            },
            "config_keys": null,
            "revision_int": 7,
            "uuid": "565ba663-59c6-419a-a530-6c1917f88857"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/100470652846121670",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "SALES_AND_RETAIL"
              ],
              "locations": [
                {
                  "radiusInMiles": 0.5229118491937161,
                  "postalAddress": {
                    "regionCode": "GB",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "United Kingdom"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": 55.378051,
                    "longitude": -3.435973
                  }
                }
              ]
            },
            "jobHash": "9bb59816cf346f90a1369776a473acae",
            "jobSummary": "Develop and execute complex account plans for an extensive portfolio of large and/or complex enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to maximize sales and partner impact. Manage the sales pipeline and forecasting process for a portfolio of global large and/or high complexity accounts, ensuring alignment with sales goals and risk mitigation. Engage with a large number of customers to understand their business and technology needs, advocating internally to prioritize their requests and enhance satisfaction. Provide strategic market leadership by identifying and capitalizing on macro trends and competitive shifts, positioning GitHub as a leader in the industry. Drive enterprise-wide solution selling initiatives, crafting comprehensive proposals that address the multifaceted needs of a complex portfolio of accounts."
          },
          "import_id": "dac39e5c-53ed-4791-924e-2879839ad23c",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4269?lang=en-us",
          "client_code": "githubinc",
          "gdpr": true
        },
        "update_date": "2025-07-03T10:56:47+0000",
        "create_date": "2025-07-01T03:55:02+0000",
        "category": [
          " Sales"
        ],
        "full_location": "United Kingdom",
        "short_location": "United Kingdom",
        "multipleLocations": false
      }
    },
    {
      "data": {
        "slug": "4257",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4257",
        "title": "Senior Enterprise Account Executive II",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is expanding its Enterprise Sales team, and we’re seeking experienced professionals to drive growth and deepen our engagement with large enterprise accounts. As a Senior Enterprise Account Executive II, you will take ownership of a portfolio of high-value enterprise accounts, executing complex sales strategies, building trusted relationships with executives, and aligning GitHub’s solutions with long-term customer business objectives. The ideal candidate will be a strategic partner in scaling enterprise adoption, shaping digital transformation initiatives, and developing expertise in navigating complex deal cycles while driving sustained customer success and revenue growth in the multi-regional and/or global marketplace. Responsibilities Develop and execute account plans for a portfolio of large enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to enhance sales and partner impact. Manage the sales pipeline and forecasting process for a portfolio of medium to large complex accounts, ensuring alignment with sales goals and risk mitigation. Proactively engage with a large number of customers to understand their business needs and advocate internally to prioritize their requests. Utilize advanced market analysis techniques to develop strategic account plans that capitalize on emerging trends and competitive dynamics. Drive complex solution selling efforts, customizing GitHub's offerings to address intricate business challenges and deliver measurable outcomes for a larger set of accounts. Qualifications Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in business, Technology, Liberal Arts, or related field, AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Ability to travel approximately 25% to serve business or client needs Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field. 2+ years’ enterprise-level strategic sales or equivalent experience Knowledge of sales methodologies such as MEDDPICC or Challenger Sale, with the ability to apply these frameworks to drive sales success Demonstrated ability to understand customer needs and provide tailored solutions that drive business value Experience selling into technology accounts with an emphasis on the software development ecosystem is strongly preferred Expertise in crafting comprehensive proposals that address the multifaceted needs of a diverse set of accounts Experience in aligning cross-functional strategies across the organization to deliver a seamless customer experience and achieve common goals Compensation Range The base salary range for this job is USD $155,250.00 - USD $155,250.00 /Yr. In addition, this role also has the opportunity to earn sales incentives. On target earnings (OTE) is based on a 50/50 base salary/sales incentive. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "US Remote",
        "country": "United States",
        "country_code": "US",
        "location_type": "ANY",
        "latitude": 38.7945952,
        "longitude": -106.5348379,
        "categories": [
          {
            "name": "Revenue"
          }
        ],
        "tags2": [
          "US-Remote"
        ],
        "tags3": [
          "Revenue"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Individual Contributor"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "US Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in business, Technology, Liberal Arts, or related field, AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Ability to travel approximately 25% to serve business or client needs Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field. 2+ years’ enterprise-level strategic sales or equivalent experience Knowledge of sales methodologies such as MEDDPICC or Challenger Sale, with the ability to apply these frameworks to drive sales success Demonstrated ability to understand customer needs and provide tailored solutions that drive business value Experience selling into technology accounts with an emphasis on the software development ecosystem is strongly preferred Expertise in crafting comprehensive proposals that address the multifaceted needs of a diverse set of accounts Experience in aligning cross-functional strategies across the organization to deliver a seamless customer experience and achieve common goals",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "Develop and execute account plans for a portfolio of large enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to enhance sales and partner impact. Manage the sales pipeline and forecasting process for a portfolio of medium to large complex accounts, ensuring alignment with sales goals and risk mitigation. Proactively engage with a large number of customers to understand their business needs and advocate internally to prioritize their requests. Utilize advanced market analysis techniques to develop strategic account plans that capitalize on emerging trends and competitive dynamics. Drive complex solution selling efforts, customizing GitHub's offerings to address intricate business challenges and deliver measurable outcomes for a larger set of accounts.",
        "posted_date": "2025-06-16T22:39:00+0000",
        "apply_url": "https://careers-githubinc.icims.com/jobs/4257/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-01T03:54:54.011+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-06-27T14:16:35Z",
            "primary_posted_site_object": {
              "site": "careers-githubinc",
              "siteId": "7b8b35d9-a49c-4724-a527-04dfa39eb3c9",
              "datePosted": "2025-06-16T22:39:00+0000"
            },
            "config_keys": null,
            "revision_int": 6,
            "uuid": "f6deeba6-0afd-43fc-a14c-60a447daf712"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/114641158704898758",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "SALES_AND_RETAIL"
              ],
              "locations": [
                {
                  "radiusInMiles": 2.6691467883166546,
                  "postalAddress": {
                    "regionCode": "US",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "United States"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": 38.7945952,
                    "longitude": -106.5348379
                  }
                }
              ]
            },
            "jobHash": "8e03c872005e7b0abecef3671fde896e",
            "jobSummary": "Develop and execute account plans for a portfolio of large enterprise accounts using sales methodologies like MEDDPICC to drive high volume sales and alignment with customer objectives. Build and maintain strong relationships with executive-level decision-makers within a focused set of accounts, acting as a trusted advisor to facilitate business transformation. Expand your network of key partners and decision-makers across an array of customer accounts to enhance sales and partner impact. Manage the sales pipeline and forecasting process for a portfolio of medium to large complex accounts, ensuring alignment with sales goals and risk mitigation. Proactively engage with a large number of customers to understand their business needs and advocate internally to prioritize their requests. Utilize advanced market analysis techniques to develop strategic account plans that capitalize on emerging trends and competitive dynamics. Drive complex solution selling efforts, customizing GitHub's offerings to address intricate business challenges and deliver measurable outcomes for a larger set of accounts."
          },
          "import_id": "9c01898a-eda3-4a83-9315-cb6ad09e2964",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4257?lang=en-us",
          "client_code": "githubinc",
          "gdpr": false
        },
        "update_date": "2025-07-01T03:54:54+0000",
        "create_date": "2025-07-01T03:54:54+0000",
        "category": [
          " Revenue"
        ],
        "full_location": "United States",
        "short_location": "United States",
        "multipleLocations": false
      }
    },
    {
      "data": {
        "slug": "4225",
        "language": "en-us",
        "languages": [
          "en-us"
        ],
        "req_id": "4225",
        "title": "Senior Mid Market Account Executive I",
        "description": "About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Australia Overview GitHub is expanding its Mid-Market Account team and seeks experienced professionals to enhance our sales efforts. As a Senior Mid-Market Account Executive I, you will forge strong relationships with executive decision-makers, develop and execute account plans, and align GitHub's sales strategies with customer needs. The ideal candidate will be a key partner in driving business transformation for mid-market customers, influencing strategic technology adoption while gaining deep industry insights and contributing to long-term customer success and growth. Responsibilities Manage a medium to large number of named accounts, focusing on scaling business growth and expanding reach within the Mid-Market segment. Engage with a broader network of decision makers and stakeholders, leveraging industry expertise to build stronger relationships and influence decision-making. Develop comprehensive strategies for a portfolio of large accounts, ensuring alignment with business priorities and leveraging data-driven insights for market analysis. Utilize extensive industry knowledge to drive innovation and business transformation for customers. Identify and pursue new market opportunities, leveraging industry knowledge and strategic partnerships to expand GitHub's presence within the Mid-Market segment. Drive revenue growth through the team by helping them build a strong pipeline, accurately forecast, and drive new and existing business opportunities. Qualifications Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Ability to travel up to 25% to serve business or client needs Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level DevOps, DevSecOps, and/or AI products strategic sales or equivalent experience Deep knowledge of the mid-market segment, including key trends, challenges, and opportunities, to inform strategic account planning and execution Experience working with international clients or in a global sales environment, providing insights into diverse market dynamics and customer needs Ability to create accurate sales forecasting and pipeline management, ensuring a clear view of future revenue and enabling proactive decision making GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!",
        "location_name": "Australia Remote",
        "country": "Australia",
        "country_code": "AU",
        "location_type": "ANY",
        "latitude": -25.274398,
        "longitude": 133.775136,
        "categories": [
          {
            "name": "Sales"
          }
        ],
        "tags2": [
          "AU-Remote"
        ],
        "tags3": [
          "Sales"
        ],
        "tags4": [
          "Experienced Professional"
        ],
        "tags5": [
          "Individual Contributor"
        ],
        "tags6": [
          "Yes"
        ],
        "tags7": [
          "Global Careers (External)"
        ],
        "promotion_value": 0,
        "employment_type": "FULL_TIME",
        "qualifications": "Required Qualifications: 6+ years' experience in technology-related sales, technical selling, or a related field, OR bachelor's degree in business, Technology, Liberal Arts, or related field AND 4+ years' experience in technology-related sales, technical selling, or a related field, OR master's degree in business administration AND 2+ years' experience in technology-related sales, technical selling, or a related field, OR equivalent experience. Ability to travel up to 25% to serve business or client needs Preferred Qualifications: 8+ years' experience in technology-related sales, technical selling, or a related field 2+ years’ enterprise-level DevOps, DevSecOps, and/or AI products strategic sales or equivalent experience Deep knowledge of the mid-market segment, including key trends, challenges, and opportunities, to inform strategic account planning and execution Experience working with international clients or in a global sales environment, providing insights into diverse market dynamics and customer needs Ability to create accurate sales forecasting and pipeline management, ensuring a clear view of future revenue and enabling proactive decision making",
        "hiring_organization": "GitHub, Inc.",
        "hiring_organization_logo": "https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542",
        "responsibilities": "Manage a medium to large number of named accounts, focusing on scaling business growth and expanding reach within the Mid-Market segment. Engage with a broader network of decision makers and stakeholders, leveraging industry expertise to build stronger relationships and influence decision-making. Develop comprehensive strategies for a portfolio of large accounts, ensuring alignment with business priorities and leveraging data-driven insights for market analysis. Utilize extensive industry knowledge to drive innovation and business transformation for customers. Identify and pursue new market opportunities, leveraging industry knowledge and strategic partnerships to expand GitHub's presence within the Mid-Market segment. Drive revenue growth through the team by helping them build a strong pipeline, accurately forecast, and drive new and existing business opportunities.",
        "posted_date": "2025-06-18T01:07:00+0000",
        "apply_url": "https://globalcareers-githubinc.icims.com/jobs/4225/login",
        "internal": false,
        "searchable": true,
        "applyable": true,
        "li_easy_applyable": true,
        "ats_code": "icims",
        "meta_data": {
          "last_mod": "2025-07-01T03:54:56.366+00:00",
          "icims": {
            "jps_is_public": true,
            "date_updated": "2025-06-27T14:20:03Z",
            "primary_posted_site_object": {
              "site": "globalcareers-githubinc",
              "siteId": "48855464-2bde-48e1-af86-f8c7872d8750",
              "datePosted": "2025-06-18T01:07:00+0000"
            },
            "config_keys": null,
            "revision_int": 6,
            "uuid": "5ffd6911-e234-4356-ba98-7cdbb6bda0b0"
          },
          "googlejobs": {
            "jobName": "projects/helpful-passage-853/jobs/73818490988831430",
            "jobTitleSnippet": "",
            "companyName": "projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c",
            "searchTextSnippet": "",
            "derivedInfo": {
              "jobCategories": [
                "SALES_AND_RETAIL"
              ],
              "locations": [
                {
                  "radiusInMiles": 1.7249516216473701,
                  "postalAddress": {
                    "regionCode": "AU",
                    "sortingCode": "",
                    "recipients": [],
                    "organization": "",
                    "postalCode": "",
                    "locality": "",
                    "sublocality": "",
                    "addressLines": [
                      "Australia"
                    ],
                    "administrativeArea": "",
                    "languageCode": "",
                    "revision": 0
                  },
                  "locationType": "COUNTRY",
                  "latLng": {
                    "latitude": -25.274398,
                    "longitude": 133.775136
                  }
                }
              ]
            },
            "jobHash": "0953285bd6feff7dec08d7974f7d5be9",
            "jobSummary": "Manage a medium to large number of named accounts, focusing on scaling business growth and expanding reach within the Mid-Market segment. Engage with a broader network of decision makers and stakeholders, leveraging industry expertise to build stronger relationships and influence decision-making. Develop comprehensive strategies for a portfolio of large accounts, ensuring alignment with business priorities and leveraging data-driven insights for market analysis. Utilize extensive industry knowledge to drive innovation and business transformation for customers. Identify and pursue new market opportunities, leveraging industry knowledge and strategic partnerships to expand GitHub's presence within the Mid-Market segment. Drive revenue growth through the team by helping them build a strong pipeline, accurately forecast, and drive new and existing business opportunities."
          },
          "import_id": "8f9dfe59-bed8-480f-9ca7-cca9117d8478",
          "redirectOnApply": true,
          "import_source": "ImporterService",
          "canonical_url": "https://githubinc.jibeapply.com/jobs/4225?lang=en-us",
          "client_code": "githubinc",
          "gdpr": false
        },
        "update_date": "2025-07-01T03:54:56+0000",
        "create_date": "2025-07-01T03:54:56+0000",
        "category": [
          " Sales"
        ],
        "full_location": "Australia",
        "short_location": "Australia",
        "multipleLocations": false
      }
    }
  ],
  "locations": [],
  "totalCount": 20,
  "request_id": false,
  "meta_data": {
    "ResponseMetadata": {
      "requestId": "d450ef1d-dfcc-496e-8e60-a28d87b09015:APAb7IS4rrfCWkTMSlVSoT417nYm8gxAWA=="
    }
  },
  "count": 20,
  "languageCounts": {
    "en-us": {
      "displayName": "English",
      "count": 20
    }
  },
  "filter": {
    "facetList": {
      "tags4": [
        {
          "term": "Experienced Professional",
          "count": 20
        }
      ],
      "tags5": [
        {
          "term": "Individual Contributor",
          "count": 19
        },
        {
          "term": "Senior Manager",
          "count": 1
        }
      ],
      "tags6": [
        {
          "term": "Yes",
          "count": 18
        },
        {
          "term": "No",
          "count": 2
        }
      ]
    },
    "displayLimit": 10,
    "brands": {
      "all": [],
      "shortlist": []
    },
    "categories": {
      "all": [
        {
          "category": "Engineering",
          "numJobs": 4
        },
        {
          "category": "Sales",
          "numJobs": 11
        },
        {
          "category": "Revenue",
          "numJobs": 5
        }
      ],
      "shortlist": [
        {
          "category": "Engineering",
          "numJobs": 4
        },
        {
          "category": "Sales",
          "numJobs": 11
        },
        {
          "category": "Revenue",
          "numJobs": 5
        }
      ]
    },
    "locations": {
      "all": [
        {
          "city": null,
          "state": null,
          "country": "Australia",
          "count": 2
        },
        {
          "city": null,
          "state": null,
          "country": "Germany",
          "count": 1
        },
        {
          "city": null,
          "state": null,
          "country": "India",
          "count": 4
        },
        {
          "city": null,
          "state": null,
          "country": "Japan",
          "count": 2
        },
        {
          "city": null,
          "state": null,
          "country": "Netherlands",
          "count": 1
        },
        {
          "city": null,
          "state": null,
          "country": "United Kingdom",
          "count": 3
        },
        {
          "city": null,
          "state": null,
          "country": "United States",
          "count": 7
        }
      ],
      "shortlist": [
        {
          "city": null,
          "state": null,
          "country": "Australia",
          "count": 2
        },
        {
          "city": null,
          "state": null,
          "country": "Germany",
          "count": 1
        },
        {
          "city": null,
          "state": null,
          "country": "India",
          "count": 4
        },
        {
          "city": null,
          "state": null,
          "country": "Japan",
          "count": 2
        },
        {
          "city": null,
          "state": null,
          "country": "Netherlands",
          "count": 1
        },
        {
          "city": null,
          "state": null,
          "country": "United Kingdom",
          "count": 3
        },
        {
          "city": null,
          "state": null,
          "country": "United States",
          "count": 7
        }
      ]
    },
    "experienceLevels": {
      "all": [],
      "shortlist": []
    }
  }
}